Revit 2024 API
BuiltInFailures.FamilyFailures.CannotChangeCategory Property
 Can't change category of Family Instance
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotChangeCategory { get; }
Visual Basic
Public Shared ReadOnly Property CannotChangeCategory As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotChangeCategory {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace